rt/databinding/aegis/src/test/resources/org/apache/cxf/aegis/integration/anyTypeArrayJDOM.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
                   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
 <soap-env:Body xmlns:jns0='urn:Array' >
  <jns0:submitJDOMArray>
   <jns0:before>before items</jns0:before>
   <jns0:anything>
       <jns0:anyType><walrus xmlns='uri:iam'>tusks</walrus></jns0:anyType>
       <jns0:anyType><penguin xmlns='uri:linux'>emperor</penguin></jns0:anyType>
       <jns0:anyType><moon xmlns='uri:planets'>blue</moon></jns0:anyType>
    </jns0:anything>
    <jns0:after>after items</jns0:after>
    </jns0:submitJDOMArray>
  </soap-env:Body>
</soap-env:Envelope>
